###################################################################

# Created by write_sdc on Thu May 26 00:21:47 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 1 [get_ports regwrite_out]
set_load -pin_load 1 [get_ports branch]
set_load -pin_load 1 [get_ports mem_read]
set_load -pin_load 1 [get_ports mem_write]
set_load -pin_load 1 [get_ports mem_to_reg]
set_load -pin_load 1 [get_ports alu_src]
set_load -pin_load 1 [get_ports pc_en]
set_load -pin_load 1 [get_ports {rd_data[7]}]
set_load -pin_load 1 [get_ports {rd_data[6]}]
set_load -pin_load 1 [get_ports {rd_data[5]}]
set_load -pin_load 1 [get_ports {rd_data[4]}]
set_load -pin_load 1 [get_ports {rd_data[3]}]
set_load -pin_load 1 [get_ports {rd_data[2]}]
set_load -pin_load 1 [get_ports {rd_data[1]}]
set_load -pin_load 1 [get_ports {rd_data[0]}]
set_load -pin_load 1 [get_ports {rs_data[7]}]
set_load -pin_load 1 [get_ports {rs_data[6]}]
set_load -pin_load 1 [get_ports {rs_data[5]}]
set_load -pin_load 1 [get_ports {rs_data[4]}]
set_load -pin_load 1 [get_ports {rs_data[3]}]
set_load -pin_load 1 [get_ports {rs_data[2]}]
set_load -pin_load 1 [get_ports {rs_data[1]}]
set_load -pin_load 1 [get_ports {rs_data[0]}]
set_load -pin_load 1 [get_ports {instruction_output[15]}]
set_load -pin_load 1 [get_ports {instruction_output[14]}]
set_load -pin_load 1 [get_ports {instruction_output[13]}]
set_load -pin_load 1 [get_ports {instruction_output[12]}]
set_load -pin_load 1 [get_ports {instruction_output[11]}]
set_load -pin_load 1 [get_ports {instruction_output[10]}]
set_load -pin_load 1 [get_ports {instruction_output[9]}]
set_load -pin_load 1 [get_ports {instruction_output[8]}]
set_load -pin_load 1 [get_ports {instruction_output[7]}]
set_load -pin_load 1 [get_ports {instruction_output[6]}]
set_load -pin_load 1 [get_ports {instruction_output[5]}]
set_load -pin_load 1 [get_ports {instruction_output[4]}]
set_load -pin_load 1 [get_ports {instruction_output[3]}]
set_load -pin_load 1 [get_ports {instruction_output[2]}]
set_load -pin_load 1 [get_ports {instruction_output[1]}]
set_load -pin_load 1 [get_ports {instruction_output[0]}]
set_load -pin_load 1 [get_ports {pc_current_address_output[7]}]
set_load -pin_load 1 [get_ports {pc_current_address_output[6]}]
set_load -pin_load 1 [get_ports {pc_current_address_output[5]}]
set_load -pin_load 1 [get_ports {pc_current_address_output[4]}]
set_load -pin_load 1 [get_ports {pc_current_address_output[3]}]
set_load -pin_load 1 [get_ports {pc_current_address_output[2]}]
set_load -pin_load 1 [get_ports {pc_current_address_output[1]}]
set_load -pin_load 1 [get_ports {pc_current_address_output[0]}]
create_clock [get_ports clk]  -period 200  -waveform {0 100}
group_path -name FEEDTHROUGH  -from [list [get_ports {pc_current_address_input[7]}] [get_ports {pc_current_address_input[6]}] [get_ports {pc_current_address_input[5]}] [get_ports {pc_current_address_input[4]}] [get_ports {pc_current_address_input[3]}] [get_ports {pc_current_address_input[2]}] [get_ports {pc_current_address_input[1]}] [get_ports {pc_current_address_input[0]}] [get_ports {instruction_input[15]}] [get_ports {instruction_input[14]}] [get_ports {instruction_input[13]}] [get_ports {instruction_input[12]}] [get_ports {instruction_input[11]}] [get_ports {instruction_input[10]}] [get_ports {instruction_input[9]}] [get_ports {instruction_input[8]}] [get_ports {instruction_input[7]}] [get_ports {instruction_input[6]}] [get_ports {instruction_input[5]}] [get_ports {instruction_input[4]}] [get_ports {instruction_input[3]}] [get_ports {instruction_input[2]}] [get_ports {instruction_input[1]}] [get_ports {instruction_input[0]}] [get_ports rst] [get_ports regwrite] [get_ports {write_data[7]}] [get_ports {write_data[6]}] [get_ports {write_data[5]}] [get_ports {write_data[4]}] [get_ports {write_data[3]}] [get_ports {write_data[2]}] [get_ports {write_data[1]}] [get_ports {write_data[0]}] [get_ports {write_addr[2]}] [get_ports {write_addr[1]}] [get_ports {write_addr[0]}]]  -to [list [get_ports regwrite_out] [get_ports branch] [get_ports mem_read] [get_ports mem_write] [get_ports mem_to_reg] [get_ports alu_src] [get_ports pc_en] [get_ports {rd_data[7]}] [get_ports {rd_data[6]}] [get_ports {rd_data[5]}] [get_ports {rd_data[4]}] [get_ports {rd_data[3]}] [get_ports {rd_data[2]}] [get_ports {rd_data[1]}] [get_ports {rd_data[0]}] [get_ports {rs_data[7]}] [get_ports {rs_data[6]}] [get_ports {rs_data[5]}] [get_ports {rs_data[4]}] [get_ports {rs_data[3]}] [get_ports {rs_data[2]}] [get_ports {rs_data[1]}] [get_ports {rs_data[0]}] [get_ports {instruction_output[15]}] [get_ports {instruction_output[14]}] [get_ports {instruction_output[13]}] [get_ports {instruction_output[12]}] [get_ports {instruction_output[11]}] [get_ports {instruction_output[10]}] [get_ports {instruction_output[9]}] [get_ports {instruction_output[8]}] [get_ports {instruction_output[7]}] [get_ports {instruction_output[6]}] [get_ports {instruction_output[5]}] [get_ports {instruction_output[4]}] [get_ports {instruction_output[3]}] [get_ports {instruction_output[2]}] [get_ports {instruction_output[1]}] [get_ports {instruction_output[0]}] [get_ports {pc_current_address_output[7]}] [get_ports {pc_current_address_output[6]}] [get_ports {pc_current_address_output[5]}] [get_ports {pc_current_address_output[4]}] [get_ports {pc_current_address_output[3]}] [get_ports {pc_current_address_output[2]}] [get_ports {pc_current_address_output[1]}] [get_ports {pc_current_address_output[0]}]]
group_path -name REGIN  -from [list [get_ports {pc_current_address_input[7]}] [get_ports {pc_current_address_input[6]}] [get_ports {pc_current_address_input[5]}] [get_ports {pc_current_address_input[4]}] [get_ports {pc_current_address_input[3]}] [get_ports {pc_current_address_input[2]}] [get_ports {pc_current_address_input[1]}] [get_ports {pc_current_address_input[0]}] [get_ports {instruction_input[15]}] [get_ports {instruction_input[14]}] [get_ports {instruction_input[13]}] [get_ports {instruction_input[12]}] [get_ports {instruction_input[11]}] [get_ports {instruction_input[10]}] [get_ports {instruction_input[9]}] [get_ports {instruction_input[8]}] [get_ports {instruction_input[7]}] [get_ports {instruction_input[6]}] [get_ports {instruction_input[5]}] [get_ports {instruction_input[4]}] [get_ports {instruction_input[3]}] [get_ports {instruction_input[2]}] [get_ports {instruction_input[1]}] [get_ports {instruction_input[0]}] [get_ports rst] [get_ports regwrite] [get_ports {write_data[7]}] [get_ports {write_data[6]}] [get_ports {write_data[5]}] [get_ports {write_data[4]}] [get_ports {write_data[3]}] [get_ports {write_data[2]}] [get_ports {write_data[1]}] [get_ports {write_data[0]}] [get_ports {write_addr[2]}] [get_ports {write_addr[1]}] [get_ports {write_addr[0]}]]
group_path -name REGOUT  -to [list [get_ports regwrite_out] [get_ports branch] [get_ports mem_read] [get_ports mem_write] [get_ports mem_to_reg] [get_ports alu_src] [get_ports pc_en] [get_ports {rd_data[7]}] [get_ports {rd_data[6]}] [get_ports {rd_data[5]}] [get_ports {rd_data[4]}] [get_ports {rd_data[3]}] [get_ports {rd_data[2]}] [get_ports {rd_data[1]}] [get_ports {rd_data[0]}] [get_ports {rs_data[7]}] [get_ports {rs_data[6]}] [get_ports {rs_data[5]}] [get_ports {rs_data[4]}] [get_ports {rs_data[3]}] [get_ports {rs_data[2]}] [get_ports {rs_data[1]}] [get_ports {rs_data[0]}] [get_ports {instruction_output[15]}] [get_ports {instruction_output[14]}] [get_ports {instruction_output[13]}] [get_ports {instruction_output[12]}] [get_ports {instruction_output[11]}] [get_ports {instruction_output[10]}] [get_ports {instruction_output[9]}] [get_ports {instruction_output[8]}] [get_ports {instruction_output[7]}] [get_ports {instruction_output[6]}] [get_ports {instruction_output[5]}] [get_ports {instruction_output[4]}] [get_ports {instruction_output[3]}] [get_ports {instruction_output[2]}] [get_ports {instruction_output[1]}] [get_ports {instruction_output[0]}] [get_ports {pc_current_address_output[7]}] [get_ports {pc_current_address_output[6]}] [get_ports {pc_current_address_output[5]}] [get_ports {pc_current_address_output[4]}] [get_ports {pc_current_address_output[3]}] [get_ports {pc_current_address_output[2]}] [get_ports {pc_current_address_output[1]}] [get_ports {pc_current_address_output[0]}]]
set_input_delay -clock clk  1  [get_ports {pc_current_address_input[7]}]
set_input_delay -clock clk  1  [get_ports {pc_current_address_input[6]}]
set_input_delay -clock clk  1  [get_ports {pc_current_address_input[5]}]
set_input_delay -clock clk  1  [get_ports {pc_current_address_input[4]}]
set_input_delay -clock clk  1  [get_ports {pc_current_address_input[3]}]
set_input_delay -clock clk  1  [get_ports {pc_current_address_input[2]}]
set_input_delay -clock clk  1  [get_ports {pc_current_address_input[1]}]
set_input_delay -clock clk  1  [get_ports {pc_current_address_input[0]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[15]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[14]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[13]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[12]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[11]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[10]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[9]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[8]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[7]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[6]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[5]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[4]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[3]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[2]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[1]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[0]}]
set_input_delay -clock clk  1  [get_ports rst]
set_input_delay -clock clk  1  [get_ports regwrite]
set_input_delay -clock clk  1  [get_ports {write_data[7]}]
set_input_delay -clock clk  1  [get_ports {write_data[6]}]
set_input_delay -clock clk  1  [get_ports {write_data[5]}]
set_input_delay -clock clk  1  [get_ports {write_data[4]}]
set_input_delay -clock clk  1  [get_ports {write_data[3]}]
set_input_delay -clock clk  1  [get_ports {write_data[2]}]
set_input_delay -clock clk  1  [get_ports {write_data[1]}]
set_input_delay -clock clk  1  [get_ports {write_data[0]}]
set_input_delay -clock clk  1  [get_ports {write_addr[2]}]
set_input_delay -clock clk  1  [get_ports {write_addr[1]}]
set_input_delay -clock clk  1  [get_ports {write_addr[0]}]
set_output_delay -clock clk  1  [get_ports regwrite_out]
set_output_delay -clock clk  1  [get_ports branch]
set_output_delay -clock clk  1  [get_ports mem_read]
set_output_delay -clock clk  1  [get_ports mem_write]
set_output_delay -clock clk  1  [get_ports mem_to_reg]
set_output_delay -clock clk  1  [get_ports alu_src]
set_output_delay -clock clk  1  [get_ports pc_en]
set_output_delay -clock clk  1  [get_ports {rd_data[7]}]
set_output_delay -clock clk  1  [get_ports {rd_data[6]}]
set_output_delay -clock clk  1  [get_ports {rd_data[5]}]
set_output_delay -clock clk  1  [get_ports {rd_data[4]}]
set_output_delay -clock clk  1  [get_ports {rd_data[3]}]
set_output_delay -clock clk  1  [get_ports {rd_data[2]}]
set_output_delay -clock clk  1  [get_ports {rd_data[1]}]
set_output_delay -clock clk  1  [get_ports {rd_data[0]}]
set_output_delay -clock clk  1  [get_ports {rs_data[7]}]
set_output_delay -clock clk  1  [get_ports {rs_data[6]}]
set_output_delay -clock clk  1  [get_ports {rs_data[5]}]
set_output_delay -clock clk  1  [get_ports {rs_data[4]}]
set_output_delay -clock clk  1  [get_ports {rs_data[3]}]
set_output_delay -clock clk  1  [get_ports {rs_data[2]}]
set_output_delay -clock clk  1  [get_ports {rs_data[1]}]
set_output_delay -clock clk  1  [get_ports {rs_data[0]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[15]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[14]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[13]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[12]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[11]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[10]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[9]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[8]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[7]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[6]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[5]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[4]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[3]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[2]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[1]}]
set_output_delay -clock clk  1  [get_ports {instruction_output[0]}]
set_output_delay -clock clk  1  [get_ports {pc_current_address_output[7]}]
set_output_delay -clock clk  1  [get_ports {pc_current_address_output[6]}]
set_output_delay -clock clk  1  [get_ports {pc_current_address_output[5]}]
set_output_delay -clock clk  1  [get_ports {pc_current_address_output[4]}]
set_output_delay -clock clk  1  [get_ports {pc_current_address_output[3]}]
set_output_delay -clock clk  1  [get_ports {pc_current_address_output[2]}]
set_output_delay -clock clk  1  [get_ports {pc_current_address_output[1]}]
set_output_delay -clock clk  1  [get_ports {pc_current_address_output[0]}]
set_input_transition -max 0.1  [get_ports {pc_current_address_input[7]}]
set_input_transition -min 0.1  [get_ports {pc_current_address_input[7]}]
set_input_transition -max 0.1  [get_ports {pc_current_address_input[6]}]
set_input_transition -min 0.1  [get_ports {pc_current_address_input[6]}]
set_input_transition -max 0.1  [get_ports {pc_current_address_input[5]}]
set_input_transition -min 0.1  [get_ports {pc_current_address_input[5]}]
set_input_transition -max 0.1  [get_ports {pc_current_address_input[4]}]
set_input_transition -min 0.1  [get_ports {pc_current_address_input[4]}]
set_input_transition -max 0.1  [get_ports {pc_current_address_input[3]}]
set_input_transition -min 0.1  [get_ports {pc_current_address_input[3]}]
set_input_transition -max 0.1  [get_ports {pc_current_address_input[2]}]
set_input_transition -min 0.1  [get_ports {pc_current_address_input[2]}]
set_input_transition -max 0.1  [get_ports {pc_current_address_input[1]}]
set_input_transition -min 0.1  [get_ports {pc_current_address_input[1]}]
set_input_transition -max 0.1  [get_ports {pc_current_address_input[0]}]
set_input_transition -min 0.1  [get_ports {pc_current_address_input[0]}]
set_input_transition -max 0.1  [get_ports {instruction_input[15]}]
set_input_transition -min 0.1  [get_ports {instruction_input[15]}]
set_input_transition -max 0.1  [get_ports {instruction_input[14]}]
set_input_transition -min 0.1  [get_ports {instruction_input[14]}]
set_input_transition -max 0.1  [get_ports {instruction_input[13]}]
set_input_transition -min 0.1  [get_ports {instruction_input[13]}]
set_input_transition -max 0.1  [get_ports {instruction_input[12]}]
set_input_transition -min 0.1  [get_ports {instruction_input[12]}]
set_input_transition -max 0.1  [get_ports {instruction_input[11]}]
set_input_transition -min 0.1  [get_ports {instruction_input[11]}]
set_input_transition -max 0.1  [get_ports {instruction_input[10]}]
set_input_transition -min 0.1  [get_ports {instruction_input[10]}]
set_input_transition -max 0.1  [get_ports {instruction_input[9]}]
set_input_transition -min 0.1  [get_ports {instruction_input[9]}]
set_input_transition -max 0.1  [get_ports {instruction_input[8]}]
set_input_transition -min 0.1  [get_ports {instruction_input[8]}]
set_input_transition -max 0.1  [get_ports {instruction_input[7]}]
set_input_transition -min 0.1  [get_ports {instruction_input[7]}]
set_input_transition -max 0.1  [get_ports {instruction_input[6]}]
set_input_transition -min 0.1  [get_ports {instruction_input[6]}]
set_input_transition -max 0.1  [get_ports {instruction_input[5]}]
set_input_transition -min 0.1  [get_ports {instruction_input[5]}]
set_input_transition -max 0.1  [get_ports {instruction_input[4]}]
set_input_transition -min 0.1  [get_ports {instruction_input[4]}]
set_input_transition -max 0.1  [get_ports {instruction_input[3]}]
set_input_transition -min 0.1  [get_ports {instruction_input[3]}]
set_input_transition -max 0.1  [get_ports {instruction_input[2]}]
set_input_transition -min 0.1  [get_ports {instruction_input[2]}]
set_input_transition -max 0.1  [get_ports {instruction_input[1]}]
set_input_transition -min 0.1  [get_ports {instruction_input[1]}]
set_input_transition -max 0.1  [get_ports {instruction_input[0]}]
set_input_transition -min 0.1  [get_ports {instruction_input[0]}]
set_input_transition -max 0.1  [get_ports rst]
set_input_transition -min 0.1  [get_ports rst]
set_input_transition -max 0.1  [get_ports regwrite]
set_input_transition -min 0.1  [get_ports regwrite]
set_input_transition -max 0.1  [get_ports {write_data[7]}]
set_input_transition -min 0.1  [get_ports {write_data[7]}]
set_input_transition -max 0.1  [get_ports {write_data[6]}]
set_input_transition -min 0.1  [get_ports {write_data[6]}]
set_input_transition -max 0.1  [get_ports {write_data[5]}]
set_input_transition -min 0.1  [get_ports {write_data[5]}]
set_input_transition -max 0.1  [get_ports {write_data[4]}]
set_input_transition -min 0.1  [get_ports {write_data[4]}]
set_input_transition -max 0.1  [get_ports {write_data[3]}]
set_input_transition -min 0.1  [get_ports {write_data[3]}]
set_input_transition -max 0.1  [get_ports {write_data[2]}]
set_input_transition -min 0.1  [get_ports {write_data[2]}]
set_input_transition -max 0.1  [get_ports {write_data[1]}]
set_input_transition -min 0.1  [get_ports {write_data[1]}]
set_input_transition -max 0.1  [get_ports {write_data[0]}]
set_input_transition -min 0.1  [get_ports {write_data[0]}]
set_input_transition -max 0.1  [get_ports {write_addr[2]}]
set_input_transition -min 0.1  [get_ports {write_addr[2]}]
set_input_transition -max 0.1  [get_ports {write_addr[1]}]
set_input_transition -min 0.1  [get_ports {write_addr[1]}]
set_input_transition -max 0.1  [get_ports {write_addr[0]}]
set_input_transition -min 0.1  [get_ports {write_addr[0]}]
set_input_transition -max 0.1  [get_ports clk]
set_input_transition -min 0.1  [get_ports clk]
