###################################################################

# Created by write_sdc on Sun May 29 21:54:33 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 1 [get_ports {data_from_ram[7]}]
set_load -pin_load 1 [get_ports {data_from_ram[6]}]
set_load -pin_load 1 [get_ports {data_from_ram[5]}]
set_load -pin_load 1 [get_ports {data_from_ram[4]}]
set_load -pin_load 1 [get_ports {data_from_ram[3]}]
set_load -pin_load 1 [get_ports {data_from_ram[2]}]
set_load -pin_load 1 [get_ports {data_from_ram[1]}]
set_load -pin_load 1 [get_ports {data_from_ram[0]}]
set_load -pin_load 1 [get_ports mem_read_from_idandex]
set_load -pin_load 1 [get_ports mem_write_from_idandex]
set_load -pin_load 1 [get_ports {alu_result_from_idandex[7]}]
set_load -pin_load 1 [get_ports {alu_result_from_idandex[6]}]
set_load -pin_load 1 [get_ports {alu_result_from_idandex[5]}]
set_load -pin_load 1 [get_ports {alu_result_from_idandex[4]}]
set_load -pin_load 1 [get_ports {alu_result_from_idandex[3]}]
set_load -pin_load 1 [get_ports {alu_result_from_idandex[2]}]
set_load -pin_load 1 [get_ports {alu_result_from_idandex[1]}]
set_load -pin_load 1 [get_ports {alu_result_from_idandex[0]}]
set_load -pin_load 1 [get_ports {write_data_to_memory[7]}]
set_load -pin_load 1 [get_ports {write_data_to_memory[6]}]
set_load -pin_load 1 [get_ports {write_data_to_memory[5]}]
set_load -pin_load 1 [get_ports {write_data_to_memory[4]}]
set_load -pin_load 1 [get_ports {write_data_to_memory[3]}]
set_load -pin_load 1 [get_ports {write_data_to_memory[2]}]
set_load -pin_load 1 [get_ports {write_data_to_memory[1]}]
set_load -pin_load 1 [get_ports {write_data_to_memory[0]}]
set_load -pin_load 1 [get_ports {pc_increment_address[7]}]
set_load -pin_load 1 [get_ports {pc_increment_address[6]}]
set_load -pin_load 1 [get_ports {pc_increment_address[5]}]
set_load -pin_load 1 [get_ports {pc_increment_address[4]}]
set_load -pin_load 1 [get_ports {pc_increment_address[3]}]
set_load -pin_load 1 [get_ports {pc_increment_address[2]}]
set_load -pin_load 1 [get_ports {pc_increment_address[1]}]
set_load -pin_load 1 [get_ports {pc_increment_address[0]}]
create_clock [get_ports clk]  -period 5  -waveform {0 2.5}
group_path -name FEEDTHROUGH  -from [list [get_ports {ram_data[7]}] [get_ports {ram_data[6]}] [get_ports {ram_data[5]}] [get_ports {ram_data[4]}] [get_ports {ram_data[3]}] [get_ports {ram_data[2]}] [get_ports {ram_data[1]}] [get_ports {ram_data[0]}] [get_ports {instruction_input[15]}] [get_ports {instruction_input[14]}] [get_ports {instruction_input[13]}] [get_ports {instruction_input[12]}] [get_ports {instruction_input[11]}] [get_ports {instruction_input[10]}] [get_ports {instruction_input[9]}] [get_ports {instruction_input[8]}] [get_ports {instruction_input[7]}] [get_ports {instruction_input[6]}] [get_ports {instruction_input[5]}] [get_ports {instruction_input[4]}] [get_ports {instruction_input[3]}] [get_ports {instruction_input[2]}] [get_ports {instruction_input[1]}] [get_ports {instruction_input[0]}] [get_ports rst] [get_ports rst_registerfile]]  -to [list [get_ports {data_from_ram[7]}] [get_ports {data_from_ram[6]}] [get_ports {data_from_ram[5]}] [get_ports {data_from_ram[4]}] [get_ports {data_from_ram[3]}] [get_ports {data_from_ram[2]}] [get_ports {data_from_ram[1]}] [get_ports {data_from_ram[0]}] [get_ports mem_read_from_idandex] [get_ports mem_write_from_idandex] [get_ports {alu_result_from_idandex[7]}] [get_ports {alu_result_from_idandex[6]}] [get_ports {alu_result_from_idandex[5]}] [get_ports {alu_result_from_idandex[4]}] [get_ports {alu_result_from_idandex[3]}] [get_ports {alu_result_from_idandex[2]}] [get_ports {alu_result_from_idandex[1]}] [get_ports {alu_result_from_idandex[0]}] [get_ports {write_data_to_memory[7]}] [get_ports {write_data_to_memory[6]}] [get_ports {write_data_to_memory[5]}] [get_ports {write_data_to_memory[4]}] [get_ports {write_data_to_memory[3]}] [get_ports {write_data_to_memory[2]}] [get_ports {write_data_to_memory[1]}] [get_ports {write_data_to_memory[0]}] [get_ports {pc_increment_address[7]}] [get_ports {pc_increment_address[6]}] [get_ports {pc_increment_address[5]}] [get_ports {pc_increment_address[4]}] [get_ports {pc_increment_address[3]}] [get_ports {pc_increment_address[2]}] [get_ports {pc_increment_address[1]}] [get_ports {pc_increment_address[0]}]]
group_path -name REGIN  -from [list [get_ports {ram_data[7]}] [get_ports {ram_data[6]}] [get_ports {ram_data[5]}] [get_ports {ram_data[4]}] [get_ports {ram_data[3]}] [get_ports {ram_data[2]}] [get_ports {ram_data[1]}] [get_ports {ram_data[0]}] [get_ports {instruction_input[15]}] [get_ports {instruction_input[14]}] [get_ports {instruction_input[13]}] [get_ports {instruction_input[12]}] [get_ports {instruction_input[11]}] [get_ports {instruction_input[10]}] [get_ports {instruction_input[9]}] [get_ports {instruction_input[8]}] [get_ports {instruction_input[7]}] [get_ports {instruction_input[6]}] [get_ports {instruction_input[5]}] [get_ports {instruction_input[4]}] [get_ports {instruction_input[3]}] [get_ports {instruction_input[2]}] [get_ports {instruction_input[1]}] [get_ports {instruction_input[0]}] [get_ports rst] [get_ports rst_registerfile]]
group_path -name REGOUT  -to [list [get_ports {data_from_ram[7]}] [get_ports {data_from_ram[6]}] [get_ports {data_from_ram[5]}] [get_ports {data_from_ram[4]}] [get_ports {data_from_ram[3]}] [get_ports {data_from_ram[2]}] [get_ports {data_from_ram[1]}] [get_ports {data_from_ram[0]}] [get_ports mem_read_from_idandex] [get_ports mem_write_from_idandex] [get_ports {alu_result_from_idandex[7]}] [get_ports {alu_result_from_idandex[6]}] [get_ports {alu_result_from_idandex[5]}] [get_ports {alu_result_from_idandex[4]}] [get_ports {alu_result_from_idandex[3]}] [get_ports {alu_result_from_idandex[2]}] [get_ports {alu_result_from_idandex[1]}] [get_ports {alu_result_from_idandex[0]}] [get_ports {write_data_to_memory[7]}] [get_ports {write_data_to_memory[6]}] [get_ports {write_data_to_memory[5]}] [get_ports {write_data_to_memory[4]}] [get_ports {write_data_to_memory[3]}] [get_ports {write_data_to_memory[2]}] [get_ports {write_data_to_memory[1]}] [get_ports {write_data_to_memory[0]}] [get_ports {pc_increment_address[7]}] [get_ports {pc_increment_address[6]}] [get_ports {pc_increment_address[5]}] [get_ports {pc_increment_address[4]}] [get_ports {pc_increment_address[3]}] [get_ports {pc_increment_address[2]}] [get_ports {pc_increment_address[1]}] [get_ports {pc_increment_address[0]}]]
set_input_delay -clock clk  1  [get_ports {ram_data[7]}]
set_input_delay -clock clk  1  [get_ports {ram_data[6]}]
set_input_delay -clock clk  1  [get_ports {ram_data[5]}]
set_input_delay -clock clk  1  [get_ports {ram_data[4]}]
set_input_delay -clock clk  1  [get_ports {ram_data[3]}]
set_input_delay -clock clk  1  [get_ports {ram_data[2]}]
set_input_delay -clock clk  1  [get_ports {ram_data[1]}]
set_input_delay -clock clk  1  [get_ports {ram_data[0]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[15]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[14]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[13]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[12]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[11]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[10]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[9]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[8]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[7]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[6]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[5]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[4]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[3]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[2]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[1]}]
set_input_delay -clock clk  1  [get_ports {instruction_input[0]}]
set_input_delay -clock clk  1  [get_ports rst]
set_input_delay -clock clk  1  [get_ports rst_registerfile]
set_output_delay -clock clk  1  [get_ports {data_from_ram[7]}]
set_output_delay -clock clk  1  [get_ports {data_from_ram[6]}]
set_output_delay -clock clk  1  [get_ports {data_from_ram[5]}]
set_output_delay -clock clk  1  [get_ports {data_from_ram[4]}]
set_output_delay -clock clk  1  [get_ports {data_from_ram[3]}]
set_output_delay -clock clk  1  [get_ports {data_from_ram[2]}]
set_output_delay -clock clk  1  [get_ports {data_from_ram[1]}]
set_output_delay -clock clk  1  [get_ports {data_from_ram[0]}]
set_output_delay -clock clk  1  [get_ports mem_read_from_idandex]
set_output_delay -clock clk  1  [get_ports mem_write_from_idandex]
set_output_delay -clock clk  1  [get_ports {alu_result_from_idandex[7]}]
set_output_delay -clock clk  1  [get_ports {alu_result_from_idandex[6]}]
set_output_delay -clock clk  1  [get_ports {alu_result_from_idandex[5]}]
set_output_delay -clock clk  1  [get_ports {alu_result_from_idandex[4]}]
set_output_delay -clock clk  1  [get_ports {alu_result_from_idandex[3]}]
set_output_delay -clock clk  1  [get_ports {alu_result_from_idandex[2]}]
set_output_delay -clock clk  1  [get_ports {alu_result_from_idandex[1]}]
set_output_delay -clock clk  1  [get_ports {alu_result_from_idandex[0]}]
set_output_delay -clock clk  1  [get_ports {write_data_to_memory[7]}]
set_output_delay -clock clk  1  [get_ports {write_data_to_memory[6]}]
set_output_delay -clock clk  1  [get_ports {write_data_to_memory[5]}]
set_output_delay -clock clk  1  [get_ports {write_data_to_memory[4]}]
set_output_delay -clock clk  1  [get_ports {write_data_to_memory[3]}]
set_output_delay -clock clk  1  [get_ports {write_data_to_memory[2]}]
set_output_delay -clock clk  1  [get_ports {write_data_to_memory[1]}]
set_output_delay -clock clk  1  [get_ports {write_data_to_memory[0]}]
set_output_delay -clock clk  1  [get_ports {pc_increment_address[7]}]
set_output_delay -clock clk  1  [get_ports {pc_increment_address[6]}]
set_output_delay -clock clk  1  [get_ports {pc_increment_address[5]}]
set_output_delay -clock clk  1  [get_ports {pc_increment_address[4]}]
set_output_delay -clock clk  1  [get_ports {pc_increment_address[3]}]
set_output_delay -clock clk  1  [get_ports {pc_increment_address[2]}]
set_output_delay -clock clk  1  [get_ports {pc_increment_address[1]}]
set_output_delay -clock clk  1  [get_ports {pc_increment_address[0]}]
set_input_transition -max 0.1  [get_ports {ram_data[7]}]
set_input_transition -min 0.1  [get_ports {ram_data[7]}]
set_input_transition -max 0.1  [get_ports {ram_data[6]}]
set_input_transition -min 0.1  [get_ports {ram_data[6]}]
set_input_transition -max 0.1  [get_ports {ram_data[5]}]
set_input_transition -min 0.1  [get_ports {ram_data[5]}]
set_input_transition -max 0.1  [get_ports {ram_data[4]}]
set_input_transition -min 0.1  [get_ports {ram_data[4]}]
set_input_transition -max 0.1  [get_ports {ram_data[3]}]
set_input_transition -min 0.1  [get_ports {ram_data[3]}]
set_input_transition -max 0.1  [get_ports {ram_data[2]}]
set_input_transition -min 0.1  [get_ports {ram_data[2]}]
set_input_transition -max 0.1  [get_ports {ram_data[1]}]
set_input_transition -min 0.1  [get_ports {ram_data[1]}]
set_input_transition -max 0.1  [get_ports {ram_data[0]}]
set_input_transition -min 0.1  [get_ports {ram_data[0]}]
set_input_transition -max 0.1  [get_ports {instruction_input[15]}]
set_input_transition -min 0.1  [get_ports {instruction_input[15]}]
set_input_transition -max 0.1  [get_ports {instruction_input[14]}]
set_input_transition -min 0.1  [get_ports {instruction_input[14]}]
set_input_transition -max 0.1  [get_ports {instruction_input[13]}]
set_input_transition -min 0.1  [get_ports {instruction_input[13]}]
set_input_transition -max 0.1  [get_ports {instruction_input[12]}]
set_input_transition -min 0.1  [get_ports {instruction_input[12]}]
set_input_transition -max 0.1  [get_ports {instruction_input[11]}]
set_input_transition -min 0.1  [get_ports {instruction_input[11]}]
set_input_transition -max 0.1  [get_ports {instruction_input[10]}]
set_input_transition -min 0.1  [get_ports {instruction_input[10]}]
set_input_transition -max 0.1  [get_ports {instruction_input[9]}]
set_input_transition -min 0.1  [get_ports {instruction_input[9]}]
set_input_transition -max 0.1  [get_ports {instruction_input[8]}]
set_input_transition -min 0.1  [get_ports {instruction_input[8]}]
set_input_transition -max 0.1  [get_ports {instruction_input[7]}]
set_input_transition -min 0.1  [get_ports {instruction_input[7]}]
set_input_transition -max 0.1  [get_ports {instruction_input[6]}]
set_input_transition -min 0.1  [get_ports {instruction_input[6]}]
set_input_transition -max 0.1  [get_ports {instruction_input[5]}]
set_input_transition -min 0.1  [get_ports {instruction_input[5]}]
set_input_transition -max 0.1  [get_ports {instruction_input[4]}]
set_input_transition -min 0.1  [get_ports {instruction_input[4]}]
set_input_transition -max 0.1  [get_ports {instruction_input[3]}]
set_input_transition -min 0.1  [get_ports {instruction_input[3]}]
set_input_transition -max 0.1  [get_ports {instruction_input[2]}]
set_input_transition -min 0.1  [get_ports {instruction_input[2]}]
set_input_transition -max 0.1  [get_ports {instruction_input[1]}]
set_input_transition -min 0.1  [get_ports {instruction_input[1]}]
set_input_transition -max 0.1  [get_ports {instruction_input[0]}]
set_input_transition -min 0.1  [get_ports {instruction_input[0]}]
set_input_transition -max 0.1  [get_ports rst]
set_input_transition -min 0.1  [get_ports rst]
set_input_transition -max 0.1  [get_ports rst_registerfile]
set_input_transition -min 0.1  [get_ports rst_registerfile]
