###############################################################
#  Generated by:      Cadence Innovus 20.10-p004_1
#  OS:                Linux x86_64(Host ID EEX058)
#  Generated on:      Sun May 29 23:11:43 2022
#  Design:            riscv8bit
#  Command:           routeDesign -globalDetail
###############################################################
current_design riscv8bit
create_clock [get_ports {clk}]  -name clk -period 5.000000 -waveform {0.000000 2.500000}
set_propagated_clock  [get_ports {clk}]
set_load -pin_load -max  1  [get_ports {data_from_ram[7]}]
set_load -pin_load -min  1  [get_ports {data_from_ram[7]}]
set_load -pin_load -max  1  [get_ports {data_from_ram[6]}]
set_load -pin_load -min  1  [get_ports {data_from_ram[6]}]
set_load -pin_load -max  1  [get_ports {data_from_ram[5]}]
set_load -pin_load -min  1  [get_ports {data_from_ram[5]}]
set_load -pin_load -max  1  [get_ports {data_from_ram[4]}]
set_load -pin_load -min  1  [get_ports {data_from_ram[4]}]
set_load -pin_load -max  1  [get_ports {data_from_ram[3]}]
set_load -pin_load -min  1  [get_ports {data_from_ram[3]}]
set_load -pin_load -max  1  [get_ports {data_from_ram[2]}]
set_load -pin_load -min  1  [get_ports {data_from_ram[2]}]
set_load -pin_load -max  1  [get_ports {data_from_ram[1]}]
set_load -pin_load -min  1  [get_ports {data_from_ram[1]}]
set_load -pin_load -max  1  [get_ports {data_from_ram[0]}]
set_load -pin_load -min  1  [get_ports {data_from_ram[0]}]
set_load -pin_load -max  1  [get_ports {mem_read_from_idandex}]
set_load -pin_load -min  1  [get_ports {mem_read_from_idandex}]
set_load -pin_load -max  1  [get_ports {mem_write_from_idandex}]
set_load -pin_load -min  1  [get_ports {mem_write_from_idandex}]
set_load -pin_load -max  1  [get_ports {alu_result_from_idandex[7]}]
set_load -pin_load -min  1  [get_ports {alu_result_from_idandex[7]}]
set_load -pin_load -max  1  [get_ports {alu_result_from_idandex[6]}]
set_load -pin_load -min  1  [get_ports {alu_result_from_idandex[6]}]
set_load -pin_load -max  1  [get_ports {alu_result_from_idandex[5]}]
set_load -pin_load -min  1  [get_ports {alu_result_from_idandex[5]}]
set_load -pin_load -max  1  [get_ports {alu_result_from_idandex[4]}]
set_load -pin_load -min  1  [get_ports {alu_result_from_idandex[4]}]
set_load -pin_load -max  1  [get_ports {alu_result_from_idandex[3]}]
set_load -pin_load -min  1  [get_ports {alu_result_from_idandex[3]}]
set_load -pin_load -max  1  [get_ports {alu_result_from_idandex[2]}]
set_load -pin_load -min  1  [get_ports {alu_result_from_idandex[2]}]
set_load -pin_load -max  1  [get_ports {alu_result_from_idandex[1]}]
set_load -pin_load -min  1  [get_ports {alu_result_from_idandex[1]}]
set_load -pin_load -max  1  [get_ports {alu_result_from_idandex[0]}]
set_load -pin_load -min  1  [get_ports {alu_result_from_idandex[0]}]
set_load -pin_load -max  1  [get_ports {write_data_to_memory[7]}]
set_load -pin_load -min  1  [get_ports {write_data_to_memory[7]}]
set_load -pin_load -max  1  [get_ports {write_data_to_memory[6]}]
set_load -pin_load -min  1  [get_ports {write_data_to_memory[6]}]
set_load -pin_load -max  1  [get_ports {write_data_to_memory[5]}]
set_load -pin_load -min  1  [get_ports {write_data_to_memory[5]}]
set_load -pin_load -max  1  [get_ports {write_data_to_memory[4]}]
set_load -pin_load -min  1  [get_ports {write_data_to_memory[4]}]
set_load -pin_load -max  1  [get_ports {write_data_to_memory[3]}]
set_load -pin_load -min  1  [get_ports {write_data_to_memory[3]}]
set_load -pin_load -max  1  [get_ports {write_data_to_memory[2]}]
set_load -pin_load -min  1  [get_ports {write_data_to_memory[2]}]
set_load -pin_load -max  1  [get_ports {write_data_to_memory[1]}]
set_load -pin_load -min  1  [get_ports {write_data_to_memory[1]}]
set_load -pin_load -max  1  [get_ports {write_data_to_memory[0]}]
set_load -pin_load -min  1  [get_ports {write_data_to_memory[0]}]
set_input_transition 0.1  [get_ports {ram_data[7]}]
set_input_transition 0.1  [get_ports {ram_data[6]}]
set_input_transition 0.1  [get_ports {ram_data[5]}]
set_input_transition 0.1  [get_ports {ram_data[4]}]
set_input_transition 0.1  [get_ports {ram_data[3]}]
set_input_transition 0.1  [get_ports {ram_data[2]}]
set_input_transition 0.1  [get_ports {ram_data[1]}]
set_input_transition 0.1  [get_ports {ram_data[0]}]
set_load -pin_load -max  1  [get_ports {pc_increment_address[7]}]
set_load -pin_load -min  1  [get_ports {pc_increment_address[7]}]
set_load -pin_load -max  1  [get_ports {pc_increment_address[6]}]
set_load -pin_load -min  1  [get_ports {pc_increment_address[6]}]
set_load -pin_load -max  1  [get_ports {pc_increment_address[5]}]
set_load -pin_load -min  1  [get_ports {pc_increment_address[5]}]
set_load -pin_load -max  1  [get_ports {pc_increment_address[4]}]
set_load -pin_load -min  1  [get_ports {pc_increment_address[4]}]
set_load -pin_load -max  1  [get_ports {pc_increment_address[3]}]
set_load -pin_load -min  1  [get_ports {pc_increment_address[3]}]
set_load -pin_load -max  1  [get_ports {pc_increment_address[2]}]
set_load -pin_load -min  1  [get_ports {pc_increment_address[2]}]
set_load -pin_load -max  1  [get_ports {pc_increment_address[1]}]
set_load -pin_load -min  1  [get_ports {pc_increment_address[1]}]
set_load -pin_load -max  1  [get_ports {pc_increment_address[0]}]
set_load -pin_load -min  1  [get_ports {pc_increment_address[0]}]
set_input_transition 0.1  [get_ports {instruction_input[15]}]
set_input_transition 0.1  [get_ports {instruction_input[14]}]
set_input_transition 0.1  [get_ports {instruction_input[13]}]
set_input_transition 0.1  [get_ports {instruction_input[12]}]
set_input_transition 0.1  [get_ports {instruction_input[11]}]
set_input_transition 0.1  [get_ports {instruction_input[10]}]
set_input_transition 0.1  [get_ports {instruction_input[9]}]
set_input_transition 0.1  [get_ports {instruction_input[8]}]
set_input_transition 0.1  [get_ports {instruction_input[7]}]
set_input_transition 0.1  [get_ports {instruction_input[6]}]
set_input_transition 0.1  [get_ports {instruction_input[5]}]
set_input_transition 0.1  [get_ports {instruction_input[4]}]
set_input_transition 0.1  [get_ports {instruction_input[3]}]
set_input_transition 0.1  [get_ports {instruction_input[2]}]
set_input_transition 0.1  [get_ports {instruction_input[1]}]
set_input_transition 0.1  [get_ports {instruction_input[0]}]
set_input_transition 0.1  [get_ports {rst}]
set_input_transition 0.1  [get_ports {rst_registerfile}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {ram_data[5]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[10]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {ram_data[3]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[9]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {ram_data[1]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[7]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[5]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[3]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[1]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[15]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {rst}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[13]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {ram_data[6]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[11]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {ram_data[4]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {ram_data[2]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[8]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {ram_data[0]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[6]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[4]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[2]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[0]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[14]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {rst_registerfile}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {ram_data[7]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {instruction_input[12]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pc_increment_address[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data_to_memory[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pc_increment_address[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {alu_result_from_idandex[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data_to_memory[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {alu_result_from_idandex[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data_to_memory[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {alu_result_from_idandex[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data_to_memory[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {mem_write_from_idandex}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {alu_result_from_idandex[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {data_from_ram[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {mem_read_from_idandex}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {data_from_ram[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pc_increment_address[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {data_from_ram[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pc_increment_address[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {data_from_ram[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pc_increment_address[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data_to_memory[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pc_increment_address[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data_to_memory[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {alu_result_from_idandex[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data_to_memory[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {alu_result_from_idandex[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {write_data_to_memory[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {alu_result_from_idandex[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {data_from_ram[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {alu_result_from_idandex[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {data_from_ram[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {data_from_ram[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pc_increment_address[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {data_from_ram[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pc_increment_address[4]}]
